       IDENTIFICATION DIVISION.
       PROGRAM-ID. CONSULTA_ARCHIVO.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CLIENTES ASSIGN TO DISK.

       DATA DIVISION.
       FILE SECTION.
       FD CLIENTES.
       01 REG-CLIENTES.
           05 ID-CLIENTE-FILE PIC 9(3).
           05 NOMBRE-CLIENTE-FILE PIC X(20).
           05 CLAVE-TARJETA-FILE PIC 9(01).
           05 NOMBRE-TARJETA-FILE PIC X(08).
           05 ANUALIDAD-FILE PIC 9(05).
           05 FECHA-ALTA-FILE.
            10 Y PIC 9(4).
            10 M PIC 99.
            10 D PIC 99.
       WORKING-STORAGE SECTION.
       01 WKS-FIN PIC 9.
       01 WKS-CLIENTE PIC 9 VALUE 0.
       01 WKS-ID-CLIENTE PIC 9(3).
       01 WKS-CLIENTE-ENCONTRADO PIC X VALUE "N".

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           PERFORM 1000-INICIO.
           PERFORM 2000-PROCESO UNTIL WKS-FIN = 2.
           PERFORM 3000-FIN.
           STOP RUN.

       1000-INICIO.
           OPEN INPUT CLIENTES.

       2000-PROCESO.
           DISPLAY "INGRESE ID DE CLIENTE".
           ACCEPT WKS-ID-CLIENTE.

           PERFORM 2100-BUSCAR-CLIENTE UNTIL WKS-CLIENTE = 1.

           IF WKS-CLIENTE-ENCONTRADO = "N"
               DISPLAY "NO SE ENCONTRO EL CLIENTE".

           DISPLAY "¿QUIERES BUSCAR OTRO CLIENTE?".
           DISPLAY "1. SI".
           DISPLAY "2. NO".
           ACCEPT WKS-FIN.

           IF WKS-FIN = 1
             MOVE "N" TO WKS-CLIENTE-ENCONTRADO
             MOVE 0 TO WKS-CLIENTE.
             CLOSE CLIENTES.
             OPEN INPUT CLIENTES.

       2100-BUSCAR-CLIENTE.

           READ CLIENTES AT END MOVE 1 TO WKS-CLIENTE NOT AT END
           IF WKS-ID-CLIENTE = ID-CLIENTE-FILE
               DISPLAY "ID CLIENTE: " ID-CLIENTE-FILE
               DISPLAY "NOMBRE CLIENTE: " NOMBRE-CLIENTE-FILE
               DISPLAY "CLAVE TARJETA: " CLAVE-TARJETA-FILE
               DISPLAY "NOMBRE TARJETA: " NOMBRE-TARJETA-FILE
               DISPLAY "ANUALIDAD: " ANUALIDAD-FILE
               DISPLAY "FECHA DE ALTA: ANIO " Y " MES " M " DIA " D
               DISPLAY SPACE
               MOVE "S" TO WKS-CLIENTE-ENCONTRADO.

       3000-FIN.
           CLOSE CLIENTES.


       END PROGRAM CONSULTA_ARCHIVO.
