       IDENTIFICATION DIVISION.
       PROGRAM-ID. BORRAR.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT REG-CLI ASSIGN TO DISK
           ORGANIZATION IS INDEXED
           ACCESS MODE IS RANDOM
           RECORD KEY IS ID-CLIENTE-FILE.
       DATA DIVISION.
       FILE SECTION.
       FD REG-CLI.
       01 REG-CLIENTES.
           05 ID-CLIENTE-FILE PIC 9(3).
           05 NOMBRE-CLIENTE-FILE PIC X(20).
           05 CLAVE-TARJETA-FILE PIC 9(01).
           05 NOMBRE-TARJETA-FILE PIC X(08).
           05 ANUALIDAD-FILE PIC 9(05).
           05 FECHA-ALTA-FILE.
            10 Y PIC 9(4).
            10 M PIC 99.
            10 D PIC 99.

       WORKING-STORAGE SECTION.
       01 WKS-FIN PIC 9.
       01 WKS-ID-CLIENTE PIC 9(3).
       01 WKS-CLIENTE-EXISTE PIC X VALUE "S".
       01 WKS-ELIMINAR PIC 9 VALUE 1.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           PERFORM 1000-INICIO.
           PERFORM 2000-PROCESO UNTIL WKS-FIN = 2.
           PERFORM 3000-FIN.
           STOP RUN.

      *RUTINAS
       1000-INICIO.
           OPEN I-O REG-CLI.
           DISPLAY "*****BIENVENIDO*****".
           DISPLAY "*****ELIMINAR*****".

       2000-PROCESO.
           DISPLAY "INTRODUCE ID CLIENTE".
           ACCEPT WKS-ID-CLIENTE.

           MOVE WKS-ID-CLIENTE TO ID-CLIENTE-FILE.

           READ REG-CLI KEY IS ID-CLIENTE-FILE
           INVALID KEY DISPLAY "NO VALIDO / NO EXISTE"
           MOVE "N" TO WKS-CLIENTE-EXISTE.

           IF WKS-CLIENTE-EXISTE = "S"
           DISPLAY "ID: " ID-CLIENTE-FILE
           DISPLAY "NOMBRE: " NOMBRE-CLIENTE-FILE
           DISPLAY "CLAVE TARJETA: " CLAVE-TARJETA-FILE
           DISPLAY "NOMBRE TARJETA: " NOMBRE-TARJETA-FILE
           DISPLAY "ANUALIDAD: " ANUALIDAD-FILE


           DISPLAY "¿DESEAS ELIMINAR ESTE REGISTRO?"
           DISPLAY "1. SI".
           DISPLAY "2. NO".
           ACCEPT WKS-ELIMINAR.

           IF WKS-ELIMINAR = 1
           DELETE REG-CLI INVALID KEY DISPLAY "ID NO VALIDO"
           DISPLAY "*****REGISTRO ELIMINADO*****".

           MOVE "S" TO WKS-CLIENTE-EXISTE.
           MOVE 2 TO WKS-ELIMINAR.

           DISPLAY "¿DESEAS BUSCAR OTRO CLIENTE?".
           DISPLAY "1. SI".
           DISPLAY "2. NO".

           ACCEPT WKS-FIN.

       3000-FIN.
           CLOSE REG-CLI.

       END PROGRAM BORRAR.
