       IDENTIFICATION DIVISION.
       PROGRAM-ID. GEN-IND.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT REG-CLI ASSIGN TO DISK
           ORGANIZATION IS INDEXED
           ACCESS MODE IS RANDOM
           RECORD KEY IS ID-CLIENTE-FILE.
       DATA DIVISION.
       FILE SECTION.
       FD REG-CLI.
       01 REG-CLIENTES.
           05 ID-CLIENTE-FILE PIC 9(3).
           05 NOMBRE-CLIENTE-FILE PIC X(20).
           05 CLAVE-TARJETA-FILE PIC 9(01).
           05 NOMBRE-TARJETA-FILE PIC X(08).
           05 ANUALIDAD-FILE PIC 9(05).
           05 FECHA-ALTA-FILE.
            10 Y PIC 9(4).
            10 M PIC 99.
            10 D PIC 99.

       WORKING-STORAGE SECTION.
       01 WKS-FIN PIC 9.
       01 WKS-FECHA-ACTUAL.
           05 Año PIC 9(4).
           05 Mes PIC 99.
           05 Día PIC 99.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           PERFORM 1000-INICIO.
           PERFORM 2000-PROCESO UNTIL WKS-FIN = 2.
           PERFORM 3000-FIN.
           STOP RUN.

      *RUTINAS
       1000-INICIO.
           OPEN EXTEND REG-CLI.
           DISPLAY "*****BIENVENIDO*****".

       2000-PROCESO.
           DISPLAY "INTRODUCE ID CLIENTE".
           ACCEPT ID-CLIENTE-FILE.
           DISPLAY "INTRODUCE NOMBRE DE CLIENTE".
           ACCEPT NOMBRE-CLIENTE-FILE.
           DISPLAY "INTRODUCE CLAVE DE TARJETA".
           DISPLAY "1. DEBITO - 1,000".
           DISPLAY "2. CREDITO - 10,000".
           DISPLAY "3. NOMINA - 0".

           ACCEPT CLAVE-TARJETA-FILE.

           EVALUATE CLAVE-TARJETA-FILE
           WHEN 1
           MOVE "DEBITO" TO NOMBRE-TARJETA-FILE
           MOVE 1000 TO ANUALIDAD-FILE

           WHEN 2
           MOVE "CREDITO" TO NOMBRE-TARJETA-FILE
           MOVE 10000 TO ANUALIDAD-FILE

           WHEN 3
           MOVE "NOMINA" TO NOMBRE-TARJETA-FILE
           MOVE 0 TO ANUALIDAD-FILE.

      *    CREACION DE FECHA
           MOVE FUNCTION CURRENT-DATE TO FECHA-ALTA-FILE.

           WRITE REG-CLIENTES INVALID KEY DISPLAY "LLAVE INVALIDA".

           DISPLAY "¿DESEAS CREAR UN NUEVO CLIENTE?".
           DISPLAY "1. SI".
           DISPLAY "2. NO".

           ACCEPT WKS-FIN.

       3000-FIN.
           CLOSE REG-CLI.

       END PROGRAM GEN-IND.
